controltheory/beamer/7/7_2_sample.tex
% Created 2014-11-27 Thu 17:57
\documentclass[table]{beamer}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{信号采样与保持}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性离散系统分析}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}












\section{信号的采样}
\label{sec-1}
\begin{frame}
\frametitle{采样信号}
\label{sec-1-1}

\begin{itemize}
\item <2->\mode<article>{理想采样的结果是脉冲信号，其强度为连续信号在采样时刻的值}若采样开关为理想采样开关,则有:  
       \[e^*(t)=e(t)\delta_T(t)\]
     其中  $\delta_T(t)$  为理想单位脉冲序列:  
              \[\delta_T(t)=\sum_{n=0}^{\infty}\delta(t-nT)\]
\item <3->\mode<article>{将单位脉冲序列乘以连续信号即可完成采样，将连续信号转换成采样信号（加权脉冲序列）。}得:
     \begin{eqnarray*}
     e^{*}(t) & = & e(t)\sum_{n=0}^{\infty}\delta(t-nT) \\
       &=&  \sum_{n=0}^{\infty}e(t)\delta(t-nT) \\
       &=&  \sum_{n=0}^{\infty}e(nT)\delta(t-nT) 
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{采样信号的Laplace变换}
\label{sec-1-2}

     \begin{eqnarray*}
     {\cal L}(e^{*}(t)) & =  & {\cal L}( \sum_{n=0}^{\infty}e(nT)\delta(t-nT) )\\
     &=&  \sum_{n=0}^{\infty}e(nT){\cal L}(\delta(t-nT) )\\
     &=&  \sum_{n=0}^{\infty}e(nT)e^{-nTs}
     \end{eqnarray*}
 \mode<article>{直接计算离散信号的Laplace变换时会发现，根据Laplace变换的性质，时域出现延迟会导致复域出现  $s$  的指数函数，而不是关于 $s$ 的有理分式，难以分析。为了能够方便地分析离散信号，需要学习一种新的数学工具--- Z 变换}
\end{frame}
\begin{frame}
\frametitle{采样信号的频谱分析}
\label{sec-1-3}

 \mode<article>{换一种思路计算离散信号的Laplace变换。}
\begin{itemize}
\item <2->将  $\delta_T(t)$  以 Fourier 级数表示,得: 
      \begin{eqnarray*}
      \delta_T(t) & = &\sum_{n=-\infty}^{\infty}C_n e^{jn\omega_s t} \\
      C_n &=&\frac{1}{T}\int_{-\frac{T}{2}}^{\frac{T}{2}}\delta_T(t)e^{-jn\omega_s t}dt \\
        &=&\frac{1}{T}\int_{-\frac{T}{2}}^{\frac{T}{2}}\delta(t)dt \\ 
        &=& \frac{1}{T} \\
      \omega_s &=& \frac{2\pi}{T} 
    \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{采样信号的频谱分析(续)}
\label{sec-1-4}

\mode<article>{通过Laplace变换或Fourier变换对比分析连续信号与采样信号的频率特性，可以看到采样过程的频域描述：将连续信号的频谱平移后再叠加。 }

\begin{itemize}
\item 采样
      \begin{eqnarray*}
      \delta_T(t) &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}e^{jn\omega_s t} \\
      e^*(t) &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}e(t)e^{jn\omega_s t} \\
      E^*(s) &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}E(s+jn\omega_s ) \\
      E^*(j\omega) &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}E(j(\omega+n\omega_s)) 
      \end{eqnarray*}
\item <2->$e^*(t)$  的频谱为以  $\omega_s$  为周期的无穷多个频谱之和.
\item <3->设  $e(t)$ 带宽有限,最高角频率为  $\omega_h$ , 则当  $\omega_s>2\omega_h$  时,  $e^*(t)$  频谱的各部分不会相互重叠.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Nyquist-Shannon sampling theorem}
\label{sec-1-5}

\begin{itemize}
\item <2->若采样器的输入信号  $e(t)$ 只有有限带宽,且其最高频率分量为  $\omega_h$  ,
\item <3->当采样周期满足  
        \[T\leq\frac{2\pi}{2\omega_h}\]  
    则信号  $e(t)$  可以完全从  $e^*(t)$  中恢复出来.
\end{itemize}
\mode<article>{这是连续信号能完全从离散信号复现的保证，即：连续信号转换为离散信号时没有丢失任何信息。}
\end{frame}
\begin{frame}
\frametitle{工程中  $T$  的选取}
\label{sec-1-6}

\mode<article>{为了满足控制系统的性能指标，需要采样频率尽可能大一些。但采样频率过大或过小都有不足之处。}
\begin{itemize}
\item <2-> $T$  过小,增加计算量
\item <3-> $T$  过大,动态性能差,稳定性难保证
\item <4->经验公式:
\begin{itemize}
\item <4->在随动系统中,若校正后系统截止频率为  $\omega_c$ ,则采样频率为  $\omega_s=10\omega_c$  , 即  $T=\frac{\pi}{5\omega_c}$
\item <5->按  $t_r,t_s$  选取,   $T=\frac{T_r}{10},T=\frac{t_s}{40}$
\end{itemize}
\end{itemize}
\end{frame}
\section{采样函数Laplace变换性质}
\label{sec-2}
\begin{frame}
\frametitle{采样函数Laplace变换性质:$G^*(s)=G^*(s+jk\omega_s)$}
\label{sec-2-1}

\mode<article>{这个性质表明采样信号的Laplace变换是周期函数。}
\begin{itemize}
\item <2-> 证明:
     \begin{eqnarray*}
     G^*(s) &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}G(s+jn\omega_s) \\
     G^*(s+jk\omega_s) &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}G(s+j(n+k)\omega_s) \\
      &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}G(s+jn\omega_s)\\
      &=& G^*(s)
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{采样函数Laplace变换性质:$[G(s)E^*(s)]^*=G^*(s)E^*(s)$}
\label{sec-2-2}

\mode<article>{这个性质表明：当一个连续系统的输入信号为采样信号时，如何得到输出信号的采样。}
\begin{itemize}
\item <2-> 证明
     \begin{eqnarray*}
     [G(s)E^*(s)]^* &= & \frac{1}{T}\sum_{n=-\infty}^{\infty}[G(s+jn\omega_s)E^*(s+jn\omega_s)] \\
      &=& \frac{1}{T}\sum_{n=-\infty}^{\infty}[G(s+jn\omega_s)E^*(s)] \\
      &=& (\frac{1}{T}\sum_{n=-\infty}^{\infty}G(s+jn\omega_s))E^*(s) \\
      &=& G^*(s)E^*(s)
     \end{eqnarray*}
\end{itemize}
\end{frame}
\section{信号的保持}
\label{sec-3}
\begin{frame}
\frametitle{信号的保持}
\label{sec-3-1}

\begin{itemize}
\item <2->将数字信号及脉冲信号转换成连续的模拟信号,采用保持器.主要解决  $nT$  与  $(n+1)T$  之间的插值问题.
\item <3->保持器是具有外推功能的元件,外推公式为:  
         \[e(nT+\Delta t)=a_0+a_1 \Delta t+a_2(\Delta t)^2+\cdots+a_m(\Delta t)^m\]
   式中  $a_0,\cdots,a_m$  由过去各采样时刻  $(m+1)$ 个离散的信号  $e^*((n-i)T),(i=0,\cdots,m)$  惟一确定.
\item <4-> $m=0$ 时称为零阶保持器,
\item <5-> $m=1$ 时称为一阶保持器.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{零阶保持器}
\label{sec-3-2}

\begin{itemize}
\item <2-> $e(nT+\Delta t)=a_0$  , 当  $\Delta t=0$  时,有  $e(nT)=a_0$ , 即:按常值外推,  $e(t)=e(nT),t\in [ nT,(n+1)T)$
\item <3-> 设零阶保持器输入为  $r^*(t)=\delta(t)$  ,则输出为  $e(t)=1,t\in [ nT,(n+1)T)$  因此
     \begin{eqnarray*}
     {\cal L} (r^*) &=& 1 \\
     {\cal L} (e) &=& \frac{1}{s}-\frac{e^{-Ts}}{s} \\
     G_h(s) &=& \frac{E(s)}{R^*(s)}
            = \frac{1-e^{-Ts}}{s} \\
     G_h(j\omega) &= &\frac{1-e^{-jT\omega}}{j\omega} 
      = \frac{e^{-j\omega T/2}(e^{j\omega T/2}-e^{-j\omega T/2})}{j\omega}\\
      &=& \frac{2\sin\frac{\omega T}{2}}{\omega}e^{-j\omega T/2} \\
      &=& \frac{2\sin\frac{\pi\omega}{\omega_s}}{\omega}e^{-j\pi\omega /\omega_s} 
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{零阶保持器频率特性}
\label{sec-3-3}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-3-3-1}

\begin{tikzpicture}[scale=0.5]
%g=1-e^{-2\pi s}/s
\begin{axis}[
%axis x line=middle,axis y line= left, 
xticklabel=$\pgfmathprintnumber{\tick}\omega_s$ ,
yticklabel=$\pgfmathprintnumber{\tick}T$ ,
ylabel=$|G_h(j\omega)|$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=0,ymax=1.1,xmin=0.1,xmax=3]
\addplot[violet,thick] shell {octave -q --eval "w=[0.1:0.1:3]';m=abs(1/2/pi*(1-exp(-2*pi*j*w))./(j*w));disp([w,m]);" };
%\legend{$|G_h(j\omega)|$ , $\angle G_h(j\omega)$};
\end{axis}
\end{tikzpicture}

\begin{tikzpicture}[scale=0.5]
%g=1-e^{-2\pi s}/s
\begin{axis}[
%axis x line=middle,axis y line= left, 
xticklabel=$\pgfmathprintnumber{\tick}\omega_s$ ,
yticklabel=$\pgfmathprintnumber{\tick}\pi$ ,
ylabel=$\angle G_h(j\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-1.5,ymax=0,xmin=0,xmax=3]
\addplot[blue] plot coordinates  {(0,0) (1,-1) };
\addplot[blue] plot coordinates  {(1,0) (2,-1) };
\addplot[blue] plot coordinates  {(2,0) (3,-1) };
%\addplot plot coordinates  {(0,-1) (1,-1) (1,0)};
%\legend{$|G_h(j\omega)|$ , $\angle G_h(j\omega)$};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.3\textwidth}
\begin{block}<3->{零阶保持器特性}
\label{sec-3-3-2}

\begin{itemize}
\item 低通滤波
\item 相角迟后
\item 时间延迟
\end{itemize}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{一阶保持器}
\label{sec-3-4}

\begin{eqnarray*}
 e(nT+\Delta t) &=& a_0+a_1 \Delta t, \qquad (0\leq \Delta t < T) \\
 a_0& = & e(nT) \\
 a_1&=& \frac{e(nT)-e((n-1)T)}{T} \\
G_h(s) &=& T(1+s)\left(\frac{1-e^{-Ts}}{Ts}\right)^2 \\
G_h(j\omega) &=& \sqrt{1+(\omega T)^2}\left(\frac{2\sin\frac{\omega T}{2}}{\omega }\right)^2e^{-j(\omega T-\arctan\omega T)}
\end{eqnarray*}

\begin{itemize}
\item <2-> 高频噪声增大
\item <3-> 因此一般只用零阶保持器.
\end{itemize}
\end{frame}

\end{document}
